# IntegerRange Class

---
A class to define a range of a sequence of consecutive integer numbers
SystemObject Autodesk.Revit.DBIntegerRange
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class IntegerRange : IDisposable

    Public Class IntegerRange
    	Implements IDisposable

    public ref class IntegerRange : IDisposable

    type IntegerRange =
        class
            interface IDisposable
        end
The IntegerRange type exposes the following members.
| Name| Description
---|---|---
| High|  The upper limit of the range
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| Low|  The lower limit of the range
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the IntegerRange
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace